Revit 2027 API
StructuralSectionGeneralF Constructor
 Creates a new instance of Structural Section Flat Bar.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public StructuralSectionGeneralF(
	double width,
	double height,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams analysisParams
)
Public Sub New (
	width As Double,
	height As Double,
	centroidHorizontal As Double,
	centroidVertical As Double,
	analysisParams As StructuralSectionAnalysisParams
)
public:
StructuralSectionGeneralF(
	double width,
	double height,
	double centroidHorizontal,
	double centroidVertical,
	StructuralSectionAnalysisParams^ analysisParams
)
new :
        width : float *
        height : float *
        centroidHorizontal : float *
        centroidVertical : float *
        analysisParams : StructuralSectionAnalysisParams -> StructuralSectionGeneralF
Parameters
width Double
 Section width.
height Double
 Section height, depth.
centroidHorizontal Double
 Distance from centroid to the left extremites along horizontal axis.
centroidVertical Double
 Distance from centroid to the upper extremites along vertical axis.
analysisParams StructuralSectionAnalysisParams
 Common set of parameters for structural analysis.
See Also
Reference
StructuralSectionGeneralF Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace